app/views/kibans/_form.html.erb

  メーカー<br>
  <%= f.select :メーカー,options_from_collection_for_select(MakerDeadline.order(メーカー: :desc), :メーカー, :メーカー, :selected => @kiban.メーカー) %> <%#,:include_blank => "選択して下さい"%>
---
SELECT "maker_deadlines".* FROM "maker_deadlines" ORDER BY "maker_deadlines"."メーカー" DESC