app/controllers/kibans_controller.rb

        def index
            if @kibans == nil
              @kibans = Kiban.order(経過日: :desc)
            end
            if(params[:id] != nil)#リロード時との区別のため
              kiban = Kiban.find(params[:id]);
              date1 = change_date();
              if(date1 != nil) then #check_box選択時との区別のため
                kiban.update(最終注文日: date1)
              end
            end
            @d1 = Date.today;
            if(params[:time_change]==nil) then
              params[:time_change] = 120;
            end
            if(params[:zero]==nil) then
              params[:zero] = "false";
            end
            if(params[:finish] == nil) then
              params[:finish]="false"
            end
            if(params[:all] == nil) then
              params[:all]="false"
            end #リロードの際にパラメーターがないため初期設定として
            @kibans.each do |kiban|
              @Maker= MakerDeadline.find_by(メーカー: kiban.メーカー)
              @approaching_deadline = (kiban.最終注文日 + (@Maker.期限*365) - @d1).to_i #閏年を入れるとややこしいかつ一日の誤差は容認されたため含めていない
              kiban.update(経過日: @approaching_deadline);
---
SELECT "kibans".* FROM "kibans" WHERE "kibans"."期限間近" = ? ORDER BY "kibans"."経過日" DESC  [["期限間近", 1]]
UPDATE "kibans" SET "経過日" = ? WHERE "kibans"."id" = ?  [["経過日", 729], ["id", 3]]
SELECT "kibans".* FROM "kibans" ORDER BY "kibans"."経過日" DESC
SELECT  "maker_deadlines".* FROM "maker_deadlines" WHERE "maker_deadlines"."メーカー" = ? LIMIT ?  [["メーカー", "須磨電子"], ["LIMIT", 1]]
SELECT  "kibans".* FROM "kibans" WHERE "kibans"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
UPDATE "kibans" SET "期限間近" = ? WHERE "kibans"."id" = ?  [["期限間近", 1], ["id", 1]]

              else kiban.update(期限間近: true);
              end
              if((@Maker.期限 == 0 && params[:zero] == "true") || (params[:finish] == "true" && kiban.終了 == true && @approaching_deadline < params[:time_change].to_i) || params[:all] == "true")
                kiban.update(期限間近: true);
---
UPDATE "kibans" SET "終了" = ? WHERE "kibans"."id" = ?  [["終了", 1], ["id", 7]]

        def check
            check = Kiban.find(params[:id]); #チェックボックスを操作したidの基板のデータ
            check.update(終了: !check.終了) #終了を反転させる
---
SELECT  "kibans".* FROM "kibans" WHERE "kibans"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
UPDATE "kibans" SET "終了" = ? WHERE "kibans"."id" = ?  [["終了", nil], ["id", 1]]

        def create
            @kiban = Kiban.new(kiban_params)
            @Maker= MakerDeadline.find_by(メーカー: @kiban.メーカー)
            @approaching_deadline = (@kiban.最終注文日 + (@Maker.期限*365) - Date.today).to_i
            @kiban.経過日 = @approaching_deadline;
            respond_to do |format|
                if @kiban.save
---
SELECT  "maker_deadlines".* FROM "maker_deadlines" WHERE "maker_deadlines"."メーカー" = ? LIMIT ?  [["メーカー", "須磨電子"], ["LIMIT", 1]]
INSERT INTO "kibans" ("経過日", "基板名", "最終注文日", "メーカー", "備考") VALUES (?, ?, ?, ?, ?)  [["経過日", 609], ["基板名", "09876"], ["最終注文日", "2015-11-09"], ["メーカー", "須磨電子"], ["備考", ""]]

        def update
            respond_to do |format|
                if @kiban.update(kiban_params)
---
UPDATE "kibans" SET "メーカー" = ? WHERE "kibans"."id" = ?  [["メーカー", "須磨電子"], ["id", 4]]

        def set_kiban
            @kiban = Kiban.find_by_id(params[:id])
---
SELECT  "kibans".* FROM "kibans" WHERE "kibans"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]