app/controllers/maker_deadlines_controller.rb

        def index
            @makers = MakerDeadline.order(id: :desc)
---
SELECT "maker_deadlines".* FROM "maker_deadlines" ORDER BY "maker_deadlines"."id" DESC

        def create
            @maker = MakerDeadline.new(maker_params)

            respond_to do |format|
                if @maker.save
---
INSERT INTO "maker_deadlines" ("メーカー", "期限", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["メーカー", "須磨電子"], ["期限", 5], ["created_at", "2019-03-09 01:35:46.939694"], ["updated_at", "2019-03-09 01:35:46.939694"]]

        def set_maker
            @maker = MakerDeadline.find(params[:id])
---
SELECT  "maker_deadlines".* FROM "maker_deadlines" WHERE "maker_deadlines"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]